package com.smart.crm.web;

import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RestController;

/**
 * <p>
 * 前端控制器
 * </p>
 *
 * @author bob
 * @since 2024-06-04
 */
@RestController
public class TestController {

    @GetMapping(value = "/api/currentUser")
    public String currentUser() {
        return "{\n" +
                "    \"data\": {\n" +
                "        \"name\": \"Serati Ma\",\n" +
                "        \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/BiazfanxmamNRoxxVxka.png\",\n" +
                "        \"userid\": \"00000001\",\n" +
                "        \"email\": \"antdesign@alipay.com\",\n" +
                "        \"signature\": \"海纳百川，有容乃大\",\n" +
                "        \"title\": \"交互专家\",\n" +
                "        \"group\": \"蚂蚁金服－某某某事业群－某某平台部－某某技术部－UED\",\n" +
                "        \"tags\": [\n" +
                "            {\n" +
                "                \"key\": \"0\",\n" +
                "                \"label\": \"很有想法的\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"key\": \"1\",\n" +
                "                \"label\": \"专注设计\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"key\": \"2\",\n" +
                "                \"label\": \"辣~\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"key\": \"3\",\n" +
                "                \"label\": \"大长腿\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"key\": \"4\",\n" +
                "                \"label\": \"川妹子\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"key\": \"5\",\n" +
                "                \"label\": \"海纳百川\"\n" +
                "            }\n" +
                "        ],\n" +
                "        \"notifyCount\": 12,\n" +
                "        \"unreadCount\": 11,\n" +
                "        \"country\": \"China\",\n" +
                "        \"geographic\": {\n" +
                "            \"province\": {\n" +
                "                \"label\": \"浙江省\",\n" +
                "                \"key\": \"330000\"\n" +
                "            },\n" +
                "            \"city\": {\n" +
                "                \"label\": \"杭州市\",\n" +
                "                \"key\": \"330100\"\n" +
                "            }\n" +
                "        },\n" +
                "        \"address\": \"西湖区工专路 77 号\",\n" +
                "        \"phone\": \"0752-268888888\"\n" +
                "    }\n" +
                "}";
    }

    @GetMapping(value = "/api/login/account")
    public String account() {
        return "Hello, welcome to COLA world!";
    }

    @GetMapping(value = "/api/fake_workplace_chart_data")
    public String fake_workplace_chart_data() {
        return "{\n" +
                "    \"data\": {\n" +
                "        \"visitData\": [\n" +
                "            {\n" +
                "                \"x\": \"2024-06-15\",\n" +
                "                \"y\": 7\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-16\",\n" +
                "                \"y\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-17\",\n" +
                "                \"y\": 4\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-18\",\n" +
                "                \"y\": 2\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-19\",\n" +
                "                \"y\": 4\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-20\",\n" +
                "                \"y\": 7\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-21\",\n" +
                "                \"y\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-22\",\n" +
                "                \"y\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-23\",\n" +
                "                \"y\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-24\",\n" +
                "                \"y\": 9\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-25\",\n" +
                "                \"y\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-26\",\n" +
                "                \"y\": 3\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-27\",\n" +
                "                \"y\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-28\",\n" +
                "                \"y\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-29\",\n" +
                "                \"y\": 3\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-30\",\n" +
                "                \"y\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-07-01\",\n" +
                "                \"y\": 5\n" +
                "            }\n" +
                "        ],\n" +
                "        \"visitData2\": [\n" +
                "            {\n" +
                "                \"x\": \"2024-06-15\",\n" +
                "                \"y\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-16\",\n" +
                "                \"y\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-17\",\n" +
                "                \"y\": 4\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-18\",\n" +
                "                \"y\": 8\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-19\",\n" +
                "                \"y\": 3\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-20\",\n" +
                "                \"y\": 7\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2024-06-21\",\n" +
                "                \"y\": 2\n" +
                "            }\n" +
                "        ],\n" +
                "        \"salesData\": [\n" +
                "            {\n" +
                "                \"x\": \"1月\",\n" +
                "                \"y\": 1191\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"2月\",\n" +
                "                \"y\": 788\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"3月\",\n" +
                "                \"y\": 470\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"4月\",\n" +
                "                \"y\": 1077\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"5月\",\n" +
                "                \"y\": 214\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"6月\",\n" +
                "                \"y\": 1131\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"7月\",\n" +
                "                \"y\": 268\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"8月\",\n" +
                "                \"y\": 1044\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"9月\",\n" +
                "                \"y\": 1178\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"10月\",\n" +
                "                \"y\": 331\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"11月\",\n" +
                "                \"y\": 325\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"12月\",\n" +
                "                \"y\": 1094\n" +
                "            }\n" +
                "        ],\n" +
                "        \"searchData\": [\n" +
                "            {\n" +
                "                \"index\": 1,\n" +
                "                \"keyword\": \"搜索关键词-0\",\n" +
                "                \"count\": 445,\n" +
                "                \"range\": 70,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 2,\n" +
                "                \"keyword\": \"搜索关键词-1\",\n" +
                "                \"count\": 484,\n" +
                "                \"range\": 65,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 3,\n" +
                "                \"keyword\": \"搜索关键词-2\",\n" +
                "                \"count\": 975,\n" +
                "                \"range\": 93,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 4,\n" +
                "                \"keyword\": \"搜索关键词-3\",\n" +
                "                \"count\": 874,\n" +
                "                \"range\": 37,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 5,\n" +
                "                \"keyword\": \"搜索关键词-4\",\n" +
                "                \"count\": 627,\n" +
                "                \"range\": 26,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 6,\n" +
                "                \"keyword\": \"搜索关键词-5\",\n" +
                "                \"count\": 285,\n" +
                "                \"range\": 39,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 7,\n" +
                "                \"keyword\": \"搜索关键词-6\",\n" +
                "                \"count\": 37,\n" +
                "                \"range\": 67,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 8,\n" +
                "                \"keyword\": \"搜索关键词-7\",\n" +
                "                \"count\": 182,\n" +
                "                \"range\": 71,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 9,\n" +
                "                \"keyword\": \"搜索关键词-8\",\n" +
                "                \"count\": 900,\n" +
                "                \"range\": 8,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 10,\n" +
                "                \"keyword\": \"搜索关键词-9\",\n" +
                "                \"count\": 46,\n" +
                "                \"range\": 43,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 11,\n" +
                "                \"keyword\": \"搜索关键词-10\",\n" +
                "                \"count\": 460,\n" +
                "                \"range\": 10,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 12,\n" +
                "                \"keyword\": \"搜索关键词-11\",\n" +
                "                \"count\": 148,\n" +
                "                \"range\": 28,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 13,\n" +
                "                \"keyword\": \"搜索关键词-12\",\n" +
                "                \"count\": 491,\n" +
                "                \"range\": 41,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 14,\n" +
                "                \"keyword\": \"搜索关键词-13\",\n" +
                "                \"count\": 196,\n" +
                "                \"range\": 3,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 15,\n" +
                "                \"keyword\": \"搜索关键词-14\",\n" +
                "                \"count\": 661,\n" +
                "                \"range\": 29,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 16,\n" +
                "                \"keyword\": \"搜索关键词-15\",\n" +
                "                \"count\": 324,\n" +
                "                \"range\": 44,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 17,\n" +
                "                \"keyword\": \"搜索关键词-16\",\n" +
                "                \"count\": 516,\n" +
                "                \"range\": 29,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 18,\n" +
                "                \"keyword\": \"搜索关键词-17\",\n" +
                "                \"count\": 563,\n" +
                "                \"range\": 51,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 19,\n" +
                "                \"keyword\": \"搜索关键词-18\",\n" +
                "                \"count\": 402,\n" +
                "                \"range\": 56,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 20,\n" +
                "                \"keyword\": \"搜索关键词-19\",\n" +
                "                \"count\": 497,\n" +
                "                \"range\": 30,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 21,\n" +
                "                \"keyword\": \"搜索关键词-20\",\n" +
                "                \"count\": 107,\n" +
                "                \"range\": 29,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 22,\n" +
                "                \"keyword\": \"搜索关键词-21\",\n" +
                "                \"count\": 687,\n" +
                "                \"range\": 24,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 23,\n" +
                "                \"keyword\": \"搜索关键词-22\",\n" +
                "                \"count\": 968,\n" +
                "                \"range\": 77,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 24,\n" +
                "                \"keyword\": \"搜索关键词-23\",\n" +
                "                \"count\": 800,\n" +
                "                \"range\": 69,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 25,\n" +
                "                \"keyword\": \"搜索关键词-24\",\n" +
                "                \"count\": 251,\n" +
                "                \"range\": 9,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 26,\n" +
                "                \"keyword\": \"搜索关键词-25\",\n" +
                "                \"count\": 961,\n" +
                "                \"range\": 81,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 27,\n" +
                "                \"keyword\": \"搜索关键词-26\",\n" +
                "                \"count\": 688,\n" +
                "                \"range\": 14,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 28,\n" +
                "                \"keyword\": \"搜索关键词-27\",\n" +
                "                \"count\": 683,\n" +
                "                \"range\": 84,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 29,\n" +
                "                \"keyword\": \"搜索关键词-28\",\n" +
                "                \"count\": 768,\n" +
                "                \"range\": 33,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 30,\n" +
                "                \"keyword\": \"搜索关键词-29\",\n" +
                "                \"count\": 785,\n" +
                "                \"range\": 98,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 31,\n" +
                "                \"keyword\": \"搜索关键词-30\",\n" +
                "                \"count\": 471,\n" +
                "                \"range\": 16,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 32,\n" +
                "                \"keyword\": \"搜索关键词-31\",\n" +
                "                \"count\": 163,\n" +
                "                \"range\": 92,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 33,\n" +
                "                \"keyword\": \"搜索关键词-32\",\n" +
                "                \"count\": 831,\n" +
                "                \"range\": 11,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 34,\n" +
                "                \"keyword\": \"搜索关键词-33\",\n" +
                "                \"count\": 60,\n" +
                "                \"range\": 69,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 35,\n" +
                "                \"keyword\": \"搜索关键词-34\",\n" +
                "                \"count\": 645,\n" +
                "                \"range\": 62,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 36,\n" +
                "                \"keyword\": \"搜索关键词-35\",\n" +
                "                \"count\": 391,\n" +
                "                \"range\": 3,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 37,\n" +
                "                \"keyword\": \"搜索关键词-36\",\n" +
                "                \"count\": 454,\n" +
                "                \"range\": 68,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 38,\n" +
                "                \"keyword\": \"搜索关键词-37\",\n" +
                "                \"count\": 783,\n" +
                "                \"range\": 92,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 39,\n" +
                "                \"keyword\": \"搜索关键词-38\",\n" +
                "                \"count\": 982,\n" +
                "                \"range\": 41,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 40,\n" +
                "                \"keyword\": \"搜索关键词-39\",\n" +
                "                \"count\": 552,\n" +
                "                \"range\": 51,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 41,\n" +
                "                \"keyword\": \"搜索关键词-40\",\n" +
                "                \"count\": 120,\n" +
                "                \"range\": 6,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 42,\n" +
                "                \"keyword\": \"搜索关键词-41\",\n" +
                "                \"count\": 172,\n" +
                "                \"range\": 99,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 43,\n" +
                "                \"keyword\": \"搜索关键词-42\",\n" +
                "                \"count\": 174,\n" +
                "                \"range\": 72,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 44,\n" +
                "                \"keyword\": \"搜索关键词-43\",\n" +
                "                \"count\": 53,\n" +
                "                \"range\": 55,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 45,\n" +
                "                \"keyword\": \"搜索关键词-44\",\n" +
                "                \"count\": 240,\n" +
                "                \"range\": 43,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 46,\n" +
                "                \"keyword\": \"搜索关键词-45\",\n" +
                "                \"count\": 704,\n" +
                "                \"range\": 15,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 47,\n" +
                "                \"keyword\": \"搜索关键词-46\",\n" +
                "                \"count\": 239,\n" +
                "                \"range\": 42,\n" +
                "                \"status\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 48,\n" +
                "                \"keyword\": \"搜索关键词-47\",\n" +
                "                \"count\": 283,\n" +
                "                \"range\": 29,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 49,\n" +
                "                \"keyword\": \"搜索关键词-48\",\n" +
                "                \"count\": 293,\n" +
                "                \"range\": 18,\n" +
                "                \"status\": 0\n" +
                "            },\n" +
                "            {\n" +
                "                \"index\": 50,\n" +
                "                \"keyword\": \"搜索关键词-49\",\n" +
                "                \"count\": 259,\n" +
                "                \"range\": 92,\n" +
                "                \"status\": 0\n" +
                "            }\n" +
                "        ],\n" +
                "        \"offlineData\": [\n" +
                "            {\n" +
                "                \"name\": \"Stores 0\",\n" +
                "                \"cvr\": 0.8\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 1\",\n" +
                "                \"cvr\": 0.2\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 2\",\n" +
                "                \"cvr\": 0.7\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 3\",\n" +
                "                \"cvr\": 0.2\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 4\",\n" +
                "                \"cvr\": 0.6\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 5\",\n" +
                "                \"cvr\": 0.1\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 6\",\n" +
                "                \"cvr\": 0.2\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 7\",\n" +
                "                \"cvr\": 0.4\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 8\",\n" +
                "                \"cvr\": 0.6\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Stores 9\",\n" +
                "                \"cvr\": 0.8\n" +
                "            }\n" +
                "        ],\n" +
                "        \"offlineChartData\": [\n" +
                "            {\n" +
                "                \"x\": 1718447699069,\n" +
                "                \"y1\": 18,\n" +
                "                \"y2\": 100\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718449499069,\n" +
                "                \"y1\": 28,\n" +
                "                \"y2\": 22\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718451299069,\n" +
                "                \"y1\": 28,\n" +
                "                \"y2\": 37\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718453099069,\n" +
                "                \"y1\": 41,\n" +
                "                \"y2\": 77\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718454899069,\n" +
                "                \"y1\": 87,\n" +
                "                \"y2\": 18\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718456699069,\n" +
                "                \"y1\": 105,\n" +
                "                \"y2\": 63\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718458499069,\n" +
                "                \"y1\": 68,\n" +
                "                \"y2\": 105\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718460299069,\n" +
                "                \"y1\": 79,\n" +
                "                \"y2\": 71\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718462099069,\n" +
                "                \"y1\": 102,\n" +
                "                \"y2\": 21\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718463899069,\n" +
                "                \"y1\": 65,\n" +
                "                \"y2\": 85\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718465699069,\n" +
                "                \"y1\": 53,\n" +
                "                \"y2\": 59\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718467499069,\n" +
                "                \"y1\": 88,\n" +
                "                \"y2\": 84\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718469299069,\n" +
                "                \"y1\": 57,\n" +
                "                \"y2\": 29\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718471099069,\n" +
                "                \"y1\": 32,\n" +
                "                \"y2\": 47\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718472899069,\n" +
                "                \"y1\": 33,\n" +
                "                \"y2\": 107\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718474699069,\n" +
                "                \"y1\": 108,\n" +
                "                \"y2\": 27\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718476499069,\n" +
                "                \"y1\": 89,\n" +
                "                \"y2\": 92\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718478299069,\n" +
                "                \"y1\": 73,\n" +
                "                \"y2\": 98\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718480099069,\n" +
                "                \"y1\": 98,\n" +
                "                \"y2\": 71\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": 1718481899069,\n" +
                "                \"y1\": 88,\n" +
                "                \"y2\": 98\n" +
                "            }\n" +
                "        ],\n" +
                "        \"salesTypeData\": [\n" +
                "            {\n" +
                "                \"x\": \"家用电器\",\n" +
                "                \"y\": 4544\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"食用酒水\",\n" +
                "                \"y\": 3321\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"个护健康\",\n" +
                "                \"y\": 3113\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"服饰箱包\",\n" +
                "                \"y\": 2341\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"母婴产品\",\n" +
                "                \"y\": 1231\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"其他\",\n" +
                "                \"y\": 1231\n" +
                "            }\n" +
                "        ],\n" +
                "        \"salesTypeDataOnline\": [\n" +
                "            {\n" +
                "                \"x\": \"家用电器\",\n" +
                "                \"y\": 244\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"食用酒水\",\n" +
                "                \"y\": 321\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"个护健康\",\n" +
                "                \"y\": 311\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"服饰箱包\",\n" +
                "                \"y\": 41\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"母婴产品\",\n" +
                "                \"y\": 121\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"其他\",\n" +
                "                \"y\": 111\n" +
                "            }\n" +
                "        ],\n" +
                "        \"salesTypeDataOffline\": [\n" +
                "            {\n" +
                "                \"x\": \"家用电器\",\n" +
                "                \"y\": 99\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"食用酒水\",\n" +
                "                \"y\": 188\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"个护健康\",\n" +
                "                \"y\": 344\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"服饰箱包\",\n" +
                "                \"y\": 255\n" +
                "            },\n" +
                "            {\n" +
                "                \"x\": \"其他\",\n" +
                "                \"y\": 65\n" +
                "            }\n" +
                "        ],\n" +
                "        \"radarData\": [\n" +
                "            {\n" +
                "                \"name\": \"个人\",\n" +
                "                \"label\": \"引用\",\n" +
                "                \"value\": 10\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"个人\",\n" +
                "                \"label\": \"口碑\",\n" +
                "                \"value\": 8\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"个人\",\n" +
                "                \"label\": \"产量\",\n" +
                "                \"value\": 4\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"个人\",\n" +
                "                \"label\": \"贡献\",\n" +
                "                \"value\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"个人\",\n" +
                "                \"label\": \"热度\",\n" +
                "                \"value\": 7\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"团队\",\n" +
                "                \"label\": \"引用\",\n" +
                "                \"value\": 3\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"团队\",\n" +
                "                \"label\": \"口碑\",\n" +
                "                \"value\": 9\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"团队\",\n" +
                "                \"label\": \"产量\",\n" +
                "                \"value\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"团队\",\n" +
                "                \"label\": \"贡献\",\n" +
                "                \"value\": 3\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"团队\",\n" +
                "                \"label\": \"热度\",\n" +
                "                \"value\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"部门\",\n" +
                "                \"label\": \"引用\",\n" +
                "                \"value\": 4\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"部门\",\n" +
                "                \"label\": \"口碑\",\n" +
                "                \"value\": 1\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"部门\",\n" +
                "                \"label\": \"产量\",\n" +
                "                \"value\": 6\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"部门\",\n" +
                "                \"label\": \"贡献\",\n" +
                "                \"value\": 5\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"部门\",\n" +
                "                \"label\": \"热度\",\n" +
                "                \"value\": 7\n" +
                "            }\n" +
                "        ]\n" +
                "    }\n" +
                "}";
    }

    @GetMapping(value = "/api/activities")
    public String activities() {
        return "{\n" +
                "    \"data\": [\n" +
                "        {\n" +
                "            \"id\": \"trend-1\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"曲丽丽\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/BiazfanxmamNRoxxVxka.png\"\n" +
                "            },\n" +
                "            \"group\": {\n" +
                "                \"name\": \"高逼格设计天团\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"六月迭代\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"在 @{group} 新建项目 @{project}\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": \"trend-2\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"付小小\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/cnrhVkzwxjPwAaCfPbdc.png\"\n" +
                "            },\n" +
                "            \"group\": {\n" +
                "                \"name\": \"高逼格设计天团\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"六月迭代\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"在 @{group} 新建项目 @{project}\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": \"trend-3\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"林东东\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/gaOngJwsRYRaVAuXXcmB.png\"\n" +
                "            },\n" +
                "            \"group\": {\n" +
                "                \"name\": \"中二少女团\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"六月迭代\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"在 @{group} 新建项目 @{project}\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": \"trend-4\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"周星星\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/WhxKECPNujWoWEFNdnJE.png\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"5 月日常迭代\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"将 @{project} 更新至已发布状态\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": \"trend-5\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"朱偏右\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/ubnKSIfAJTxIgXOKlciN.png\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"工程效能\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"comment\": {\n" +
                "                \"name\": \"留言\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"在 @{project} 发布了 @{comment}\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": \"trend-6\",\n" +
                "            \"updatedAt\": \"2024-06-15T10:35:55.118Z\",\n" +
                "            \"user\": {\n" +
                "                \"name\": \"乐哥\",\n" +
                "                \"avatar\": \"https://gw.alipayobjects.com/zos/rmsportal/jZUIxmJycoymBprLOUbT.png\"\n" +
                "            },\n" +
                "            \"group\": {\n" +
                "                \"name\": \"程序员日常\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"project\": {\n" +
                "                \"name\": \"品牌迭代\",\n" +
                "                \"link\": \"http://github.com/\"\n" +
                "            },\n" +
                "            \"template\": \"在 @{group} 新建项目 @{project}\"\n" +
                "        }\n" +
                "    ]\n" +
                "}";
    }
}
